#это первый слой в котором мы билдим приложение для того чтобы во втором просто запустить без лишних sdk
#AS build - это просто наименование стадии
FROM node:20-alpine AS build 

#Все последующие команды (COPY, RUN, CMD) будут выполняться относительно /app
WORKDIR /app

COPY package*.json ./

RUN npm ci

COPY . .

RUN npm run build

#это второй слой в котором мы просто создаем окружение для запуска приложения
FROM nginx:1.27-alpine

#мы в проекте создали конфиг нджинкса и тут мы его прокидываем в контейнере в директорию где находятся базовые конфиги для нджинкса чтобы он его прочитал.
COPY nginx.conf /etc/nginx/conf.d/default.conf

#мы берем файлы проекта реакте и закизываем их в директорию базовую на nginx где хранятся все html чотбы просто там лежал наш index.html из реакта, и он будет приниматься nginxom как базовый
COPY --from=build /app/dist /usr/share/nginx/html

EXPOSE 80

CMD ["nginx", "-g", "daemon off;"]